In [10]:

import pandas as pd
import numpy as np 
#fmt:off
import seaborn as sns
import matplotlib.pyplot as plt
import chardet as ch
import os
#fmt:on

#  introducing "DoB" column

In [36]:
def get_encoding(file):
    with open(file, 'rb') as f:
        result = ch.detect(f.read())
    return result['encoding']

In [38]:
data_list = ['/home/theghost001/Pictures/practice_with_H/data/travel_first_half - Travel.csv', '/home/theghost001/Pictures/practice_with_H/data/travel_second_half - Travel.csv']

In [39]:
for data in data_list:
    print(get_encoding(data))

ascii
ascii

In [41]:
data1 = pd.read_csv('/home/theghost001/Pictures/practice_with_H/data/travel_first_half - Travel.csv', encoding='ascii')
data2 = pd.read_csv('/home/theghost001/Pictures/practice_with_H/data/travel_second_half - Travel.csv', encoding='ascii')

In [ ]:
# for i in data_list:
#   try:
#     data1 = pd.read_csv(i, encoding=get_encoding(i))
#   except UnicodeDecodeError:
#     print("UnicodeDecodeError: Encountered issues with the encoding. Please check the data source or try specifying a different encoding.")

UnicodeDecodeError: Encountered issues with the encoding. Please check the data source or try specifying a different encoding.
UnicodeDecodeError: Encountered issues with the encoding. Please check the data source or try specifying a different encoding.

In [42]:
data1.head()

,CustomerID,ProdTaken,Age,TypeofContact,CityTier,DurationOfPitch,Occupation,Gender,NumberOfPersonVisiting
0,200000,1,41.0,Self Enquiry,3,6.0,Salaried,Female,3
1,200001,0,49.0,Company Invited,1,14.0,Salaried,Male,3
2,200002,1,37.0,Self Enquiry,1,8.0,Free Lancer,Male,3
3,200003,0,33.0,Company Invited,1,9.0,Salaried,Female,2
4,200004,0,NaN,Self Enquiry,1,8.0,Small Business,Male,2

In [43]:
data2.head()

,CustomerID,NumberOfFollowups,ProductPitched,PreferredPropertyStar,MaritalStatus,NumberOfTrips,Passport,PitchSatisfactionScore,OwnCar,NumberOfChildrenVisiting,Designation,MonthlyIncome
0,200000,3.0,Deluxe,3.0,Single,1.0,1,2,1,0.0,Manager,20993.0
1,200001,4.0,Deluxe,4.0,Divorced,2.0,0,3,1,2.0,Manager,20130.0
2,200002,4.0,Basic,3.0,Single,7.0,1,3,0,0.0,Executive,17090.0
3,200003,3.0,Basic,3.0,Divorced,2.0,1,5,1,1.0,Executive,17909.0
4,200004,3.0,Basic,4.0,Divorced,1.0,0,5,1,0.0,Executive,18468.0

In [61]:
from datetime import datetime,timedelta
now = datetime.now()
print(now)
startDate = datetime(2010,1,1)
endDate = datetime(2015,12,31)
timeBetweenDates = endDate - startDate
print('time betwen dates is {}'.format(timeBetweenDates))
daysBetweenDates = timeBetweenDates.days
print('days between dates is {}'.format(daysBetweenDates))
#randomNumberOfDays = np.random.randint(0,daysBetweenDates)
# randomNumberOfDays = int(np.random.rand() * daysBetweenDates)
# randomDate = startDate + timedelta(days=randomNumberOfDays)
# data1['DateOfBirth'] = pd.to_datetime(randomDate)

2025-01-17 12:23:48.641347
time betwen dates is 2190 days, 0:00:00
days between dates is 2190

In [67]:
for index, row in data1.iterrows():
    randomNumberOfDays = int(np.random.rand() * daysBetweenDates)
    randomDate = startDate + timedelta(days=randomNumberOfDays)
    data1.loc[index, 'DateofBirth'] = randomDate

In [74]:
data1[['CustomerID','DateofBirth']].head(5)

   CustomerID DateofBirth
0      200000  2014-04-25
1      200001  2011-05-17
2      200002  2012-04-21
3      200003  2011-02-06
4      200004  2015-10-05

In [78]:
data1[['CustomerID','DateofBirth']].sample(5)

      CustomerID DateofBirth
22        200022  2013-05-06
1358      201358  2012-08-22
3613      203613  2014-06-01
3355      203355  2011-06-08
1271      201271  2011-09-19

In [85]:
# date of birth from age column

#1. handling missing values in age column
data1['Age'].isnull().sum()
#now = datetime.now()
#data1['DateofBirth(AGE)'] = now - pd.to_timedelta(data1['Age'])

np.int64(226)

In [81]:
#data1['DateofBirth(AGE)'].head()

0   2025-01-17 12:41:57.382168959
1   2025-01-17 12:41:57.382168951
2   2025-01-17 12:41:57.382168963
3   2025-01-17 12:41:57.382168967
4                             NaT
Name: DateofBirth(AGE), dtype: datetime64[ns]

In [103]:
print(data1['Age'].info())
print('*'*50)
print(data1['Age'].describe())
print('*'*50)
print(data1['Age'].value_counts())
print('*'*50)
print(data1['Age'].isnull().sum())
print('*'*50)

<class 'pandas.core.series.Series'>
RangeIndex: 4888 entries, 0 to 4887
Series name: Age
Non-Null Count  Dtype
--------------  -----
4662 non-null   float64
dtypes: float64(1)
memory usage: 38.3 KB
None
**************************************************
count    4662.000000
mean       37.622265
std         9.316387
min        18.000000
25%        31.000000
50%        36.000000
75%        44.000000
max        61.000000
Name: Age, dtype: float64
**************************************************
Age
35.0    237
36.0    231
34.0    211
31.0    203
30.0    199
32.0    197
33.0    189
37.0    185
29.0    178
38.0    176
41.0    155
39.0    150
28.0    147
40.0    146
42.0    142
27.0    138
43.0    130
46.0    121
45.0    116
26.0    106
44.0    105
51.0     90
47.0     88
50.0     86
25.0     74
52.0     68
53.0     66
49.0     65
48.0     65
55.0     64
54.0     61
56.0     58
24.0     56
23.0     46
22.0     46
59.0     44
21.0     41
20.0     38
19.0     32
58.0     31
57.0     29
60.0     29
18.0     14
61.0      9
Name: count, dtype: int64
**************************************************
226
**************************************************

In [89]:
(4888 - 4662)

percentages = data1['Age'].value_counts(normalize=True) * 100

226

In [2]:
data1['Age'].unique()
data1['Age'].nunique()

NameError: name 'data1' is not defined

In [1]:
data1.columns

NameError: name 'data1' is not defined

In [116]:
#checking imputed data encoding
data_list2 = ['/home/theghost001/Pictures/practice_with_H/data/null_value_imputed_data1.csv', '/home/theghost001/Pictures/practice_with_H/data/null_value_imputed_data2.csv']

In [117]:
for data in data_list2:
    print(get_encoding(data))

ascii
ascii

In [118]:
#loading imputed dataset
imputed_data1 = pd.read_csv('/home/theghost001/Pictures/practice_with_H/data/null_value_imputed_data1.csv',encoding='ascii')
imputed_data2 = pd.read_csv('/home/theghost001/Pictures/practice_with_H/data/null_value_imputed_data2.csv',encoding='ascii')

In [119]:
imputed_data1.isnull().sum()

CustomerID         0
ProdTaken          0
Age                0
TypeofContact      0
CityTier           0
DurationOfPitch    0
Occupation         0
Gender             0
Totalvisiting      0
dtype: int64

In [120]:
imputed_data2.isnull().sum()

CustomerID                0
NumberOfFollowups         0
ProductPitched            0
PreferredPropertyStar     0
MaritalStatus             0
NumberOfTrips             0
Passport                  0
PitchSatisfactionScore    0
OwnCar                    0
Designation               0
MonthlyIncome             0
dtype: int64

In [3]:
import numpy as np
import pandas as pd
data1 = pd.read_csv("/home/theghost001/Pictures/practice_with_H/data/null_value_imputed_data1.csv", encoding='ascii')
data2 = pd.read_csv("/home/theghost001/Pictures/practice_with_H/data/null_value_imputed_data2.csv", encoding='ascii')

In [4]:
data1.head()

,CustomerID,DateOfBirth(age),ProdTaken,Age,TypeofContact,CityTier,DurationOfPitch,Occupation,Totalvisiting,DateofBirth,Date(birth),Month(birth),Year(birth),TypeofContact(Allias)
0,200000,1984-01,1,41.0,Self Enquiry,3,6.0,Salaried,3.0,2015-04-28,28,4,2015,SE
1,200001,1976-01,0,49.0,Company Invited,1,14.0,Salaried,5.0,2010-02-19,19,2,2010,CI
2,200002,1988-01,1,37.0,Self Enquiry,1,8.0,Free Lancer,3.0,2013-09-11,11,9,2013,SE
3,200003,1992-01,0,33.0,Company Invited,1,9.0,Salaried,3.0,2011-11-12,12,11,2011,CI
4,200004,1989-01,0,36.0,Self Enquiry,1,8.0,Small Business,2.0,2014-01-19,19,1,2014,SE

In [5]:
data2.head()

,CustomerID,NumberOfFollowups,ProductPitched,PreferredPropertyStar,MaritalStatus,NumberOfTrips,Passport,PitchSatisfactionScore,OwnCar,Designation,MonthlyIncome,Gender,MaritalStatus(Allias)
0,200000,3.0,Deluxe,3.0,Single,1.0,1,2,1,Manager,20993.0,Female,FS
1,200001,4.0,Deluxe,4.0,Divorced,2.0,0,3,1,Manager,20130.0,Male,MD
2,200002,4.0,Basic,3.0,Single,7.0,1,3,0,Executive,17090.0,Male,MS
3,200003,3.0,Basic,3.0,Divorced,2.0,1,5,1,Executive,17909.0,Female,FD
4,200004,3.0,Basic,4.0,Divorced,1.0,0,5,1,Executive,18468.0,Male,MD